
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
;ШШШШШШШ  Программа для проверки работы транслятора TASM  ШШШШШШШ
;ШШШШШШШ    с системой команд модели процессора MDP-08    ШШШШШШШ
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
; Test all instructions and addressing modes.
; Processor: MDP08
;   
		.ORG	   000h      ; Назначение начального адреса трансляции
;----------------------------------------------------------------
        #Include   MACROS.ASM; 
;----------------------------------------------------------------
Start:	InitStart(80h)       ; функція ініціалізації потрібних бітів і їх порівняння
		InitAndEq(08h)       ;
		GOZR       M1        ; якщо не рівні, тоді йдемо на мітку М1
		
		InitStart(40h)       ;
		InitAndEq(04h)       ;
		GOZR       M1        ; 
		
		InitStart(20h)       ;
		InitAndEq(02h)       ;
		GOZR	   M1        ; 
		
		InitStart(10h)       ;
		InitAndEq(01h)       ;
		GOZR       M1        ; 
		
		INS       C, #18h    ; у випадку рівності, пишемо в регістр С, що х дорівнює у
		GOTO      M4         ; переходимо в кінець
		
M1:		BiggerORSmaller()    ; функція порівняння
M4:		Changes()            ; функція відслідковує зміни клавіатури
		GOTO      Start      ; якщо були зміни, ще раз зчитуємо клавіатуру
;----------------------------------------------------------------
        .END			; кінець програми
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~