; ==================== БІБЛІОТЕКА МАКРОПРОЦЕДУР ПРОГРАМИ «Lab3_2» ======================

;       .NOLIST

;-------------------------------------------------------------------------------------------------------------------
#DEFINE  InitStart(Dm)	INS	  B, #Dm		; маска для числа х	у старшому розряді
#DEFCONT \				WRITE A, D			; отримуємо старший розряд для х
#DEFCONT \				INV	  A, A			; інвертуємо його
#DEFCONT \				RR	  A, A			; потім зміщуємо циклічно 4 рази вправо
#DEFCONT \				RR	  A, A			; щоб "прибрати" чотири 1 в старших розрядах,
#DEFCONT \				RR	  A, A			; треба буде створити маску
#DEFCONT \				RR	  A, A			;

;-------------------------------------------------------------------------------------------------------------------
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#DEFINE  InitAndEq(Dm)     INS     B, #Dm  ; в регістр B заносимо маску і перемножуєм
#DEFCONT \                 AND     B, AB   ; отримуємо інверсію біта числа х в регістрі В в молодших байтах
#DEFCONT \                 INS     D, #Dm  ; нова маска для старшого біту числа у
#DEFCONT \                 WRITE   A, D    ; зчитуємо в регістр А цей біт
#DEFCONT \                 XOR     A, AB   ; перевіряємо на рівність відповідні біти з х та у
;-------------------------------------------------------------------------------------------------------------------
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#DEFINE  BiggerORSmaller() WRITE   A, D    ; "повертаємо" А, бо там зараз результат XOR
#DEFCONT \                 AND     A, AB   ; біти не рівні. Перевіряємо, чи більший біт числа х за біт числа у
#DEFCONT \                 GOZR    *+4     ; якщо біт х більше, переходимо на мітку М2
#DEFCONT \                 INS     C, #03h ; якщо біт х менше за біт у, пишемо це в регістр
#DEFCONT \                 GOTO    *+4     ; переходимо в кінець
#DEFCONT \                 INS     C, #0C0h; пишемо в регістр С, що х більше за у              
;-------------------------------------------------------------------------------------------------------------------
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#DEFINE Changes()          INS     D, #0FFh; перевірка на зміну клавіатури
#DEFCONT \                 WRITE   B, D    ;
#DEFCONT \                 WRITE   A, D    ;
#DEFCONT \                 XOR     A, AB   ; якщо А = 0, нічого не змінилось і перевіряємо стан ще раз
#DEFCONT \                 GOZR    *-2     ; перевіряємо стан ще раз
;-------------------------------------------------------------------------------------------------------------------
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

;       .LIST
;*****************************************************************************************