
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
;ШШШШШШШ  Программа для проверки работы транслятора TASM  ШШШШШШШ
;ШШШШШШШ    с системой команд модели процессора MDP-08    ШШШШШШШ
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
; Test all instructions and addressing modes.
; Processor: MDP08
;
		.ORG	000h	; Назначение начального адреса трансляции
;----------------------------------------------------------------
		INS     D, #80h ;запис числа 80h до регістру D, 
						;це буде сигнал, що буде "рухатися"
		WRITE   C, D    ;перезапис із регістра D в регістр С, бо працюємо з двома регістрами
M1:		WRITE   A, D    ;перезапис із регістра D в регістр А, щоб мати змогу працювати
		RR      D, A    ;запис в регістр D зміщених вправо розрядів регістра А, щоб сигнал рухався вниз
		WRITE   A, C    ;перезапис із регістра С в регістр А, щоб повернути попередній стан регістру А
		RL      C, A    ;запис в регістр C зміщених вліво розрядів регістра А, щоб сигнал рухався вверх
		GOTO    M1      ;Переходимо на мітку М1 для зацикленення програми
;----------------------------------------------------------------
        .END			; Конец трансляции тестовой программы
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~