
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
;ШШШШШШШ  Программа для проверки работы транслятора TASM  ШШШШШШШ
;ШШШШШШШ    с системой команд модели процессора MDP-08    ШШШШШШШ
;ШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШШ
; Test all instructions and addressing modes.
; Processor: MDP08
;
		.ORG	000h	; Назначение начального адреса трансляции
;----------------------------------------------------------------
		WRITE   A, A    ;перезапис із регістра А в регістр А
M2:		WRITE   A, B    ;перезапис із регістра B в регістр А
		WRITE   A, C    ;перезапис із регістра С в регістр А
		WRITE   A, D    ;перезапис із регістра D в регістр А
		WRITE   B, A    ;перезапис із регістра А в регістр В
M3:		WRITE   B, C    ;перезапис із регістра C в регістр В
		WRITE   B, D    ;перезапис із регістра D в регістр В
		WRITE   C, A    ;перезапис із регістра А в регістр С
		WRITE   C, B    ;перезапис із регістра B в регістр С
		WRITE   C, D    ;перезапис із регістра D в регістр С
		WRITE   D, A    ;перезапис із регістра А в регістр D
		WRITE   D, B    ;перезапис із регістра B в регістр D
		WRITE   D, C    ;перезапис із регістра С в регістр D
M1:		CLR     A       ;очистка регістра  А
		CLR     B       ;очистка регістра  В
		CLR     C       ;очистка регістра  С
		CLR     D       ;очистка регістра  D
		INV     A, A    ;інверсія регістра А
		INV     B, A    ;запис в регістр B інвертоване число із регістра А
		INV     C, A    ;запис в регістр C інвертоване число із регістра А
		INV     D, A    ;запис в регістр D інвертоване число із регістра А
		OR      A, AB   ;запис в регістр A диз’юнкції регістрів А і В
		OR      B, AB   ;запис в регістр B диз’юнкції регістрів А і В
		OR      C, AB   ;запис в регістр C диз’юнкції регістрів А і В
		OR      D, AB   ;запис в регістр D диз’юнкції регістрів А і В
		AND     A, AB   ;запис в регістр А кон’юнкції регістрів А і В
		AND     B, AB   ;запис в регістр B кон’юнкції регістрів А і В
		AND     C, AB   ;запис в регістр C кон’юнкції регістрів А і В
M4:		AND     D, AB   ;запис в регістр D кон’юнкції регістрів А і В
		XOR     A, AB   ;запис в регістр А виключного АБО регістрів А і В
		XOR     B, AB   ;запис в регістр B виключного АБО регістрів А і В
		XOR     C, AB   ;запис в регістр C виключного АБО регістрів А і В
		XOR     D, AB   ;запис в регістр D виключного АБО регістрів А і В
		RL      A, A    ;циклічне зміщення розрядів в регістрі А вліво
		RL      B, A    ;запис в регістр В зміщених вліво розрядів регістра А
		RL      C, A    ;запис в регістр C зміщених вліво розрядів регістра А
		RL      D, A    ;запис в регістр D зміщених вліво розрядів регістра А
		RR      A, A    ;циклічне зміщення розрядів в регістрі А вправо
		RR      B, A    ;запис в регістр В зміщених вправо розрядів регістра А
		RR      C, A    ;запис в регістр C зміщених вправо розрядів регістра А
		RR      D, A    ;запис в регістр D зміщених вправо розрядів регістра А
		SUM     A, AB   ;запис в регістр А арифметичної суми регістрів А і В
		SUM     B, AB   ;запис в регістр В арифметичної суми регістрів А і В
		SUM     C, AB   ;запис в регістр C арифметичної суми регістрів А і В
		SUM     D, AB   ;запис в регістр D арифметичної суми регістрів А і В
		INS     A, #10d   ;запис числа 10d до регістру А
		INS     B, #00000010b   ;запис числа 00000010b до регістру В
		INS     C, #0Bh   ;запис числа 0Bh до регістру C
		INS     D, #08d   ;запис числа 08d до регістру D
		GOTO    M1      ;Переходимо на мітку М1
		GOZR    M2      ;Переходимо на мітку М2, якщо А=0
		GONZR   M3      ;Переходимо на мітку М3, якщо А!=0
		GOB     M4      ;Переходимо на мітку М4, якщо встановлено біт переносу
		GONB    M1      ;Переходимо на мітку М1, якщо біт переносу дорівнює нулю
;----------------------------------------------------------------
        .END			; Конец трансляции тестовой программы
;~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~